sessions/R13-slotted-counter/results/multi/jvm-lock-x1.k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/beomsu/Desktop/incident-lab/sessions/R13-slotted-counter/scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
              * sponsor: 100 looping VUs for 1m0s (gracefulStop: 10s)

time="2026-07-28T21:17:02+09:00" level=info msg="[분포] 시나리오=zipf 방송=1000 s=1.2 | 1위 방송 23.1% · 상위10 56.9% · 상위1% 56.9%" source=console

running (0m01.0s), 100/100 VUs, 1161 complete and 0 interrupted iterations
sponsor   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 2175 complete and 0 interrupted iterations
sponsor   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 3182 complete and 0 interrupted iterations
sponsor   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 4216 complete and 0 interrupted iterations
sponsor   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 5313 complete and 0 interrupted iterations
sponsor   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 6382 complete and 0 interrupted iterations
sponsor   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 7370 complete and 0 interrupted iterations
sponsor   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 8398 complete and 0 interrupted iterations
sponsor   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 9471 complete and 0 interrupted iterations
sponsor   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 10441 complete and 0 interrupted iterations
sponsor   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 11493 complete and 0 interrupted iterations
sponsor   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 12601 complete and 0 interrupted iterations
sponsor   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 13590 complete and 0 interrupted iterations
sponsor   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 14674 complete and 0 interrupted iterations
sponsor   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 15712 complete and 0 interrupted iterations
sponsor   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 16761 complete and 0 interrupted iterations
sponsor   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 17750 complete and 0 interrupted iterations
sponsor   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 18761 complete and 0 interrupted iterations
sponsor   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 19781 complete and 0 interrupted iterations
sponsor   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 20804 complete and 0 interrupted iterations
sponsor   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 21808 complete and 0 interrupted iterations
sponsor   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 22810 complete and 0 interrupted iterations
sponsor   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 23885 complete and 0 interrupted iterations
sponsor   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 24863 complete and 0 interrupted iterations
sponsor   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 25875 complete and 0 interrupted iterations
sponsor   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 26916 complete and 0 interrupted iterations
sponsor   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 27933 complete and 0 interrupted iterations
sponsor   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 28903 complete and 0 interrupted iterations
sponsor   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 29963 complete and 0 interrupted iterations
sponsor   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 30945 complete and 0 interrupted iterations
sponsor   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 31957 complete and 0 interrupted iterations
sponsor   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 32959 complete and 0 interrupted iterations
sponsor   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 33886 complete and 0 interrupted iterations
sponsor   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 34900 complete and 0 interrupted iterations
sponsor   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 35985 complete and 0 interrupted iterations
sponsor   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 37023 complete and 0 interrupted iterations
sponsor   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 38017 complete and 0 interrupted iterations
sponsor   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 38999 complete and 0 interrupted iterations
sponsor   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 39952 complete and 0 interrupted iterations
sponsor   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 40900 complete and 0 interrupted iterations
sponsor   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 41996 complete and 0 interrupted iterations
sponsor   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 43029 complete and 0 interrupted iterations
sponsor   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 44012 complete and 0 interrupted iterations
sponsor   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 45074 complete and 0 interrupted iterations
sponsor   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 46131 complete and 0 interrupted iterations
sponsor   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 47134 complete and 0 interrupted iterations
sponsor   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 48173 complete and 0 interrupted iterations
sponsor   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 49213 complete and 0 interrupted iterations
sponsor   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 50214 complete and 0 interrupted iterations
sponsor   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 51290 complete and 0 interrupted iterations
sponsor   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 52303 complete and 0 interrupted iterations
sponsor   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 53329 complete and 0 interrupted iterations
sponsor   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 54284 complete and 0 interrupted iterations
sponsor   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 55341 complete and 0 interrupted iterations
sponsor   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 56312 complete and 0 interrupted iterations
sponsor   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 57310 complete and 0 interrupted iterations
sponsor   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 58304 complete and 0 interrupted iterations
sponsor   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 59313 complete and 0 interrupted iterations
sponsor   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 60334 complete and 0 interrupted iterations
sponsor   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 61280 complete and 0 interrupted iterations
sponsor   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 61401   1018.694397/s
    checks_succeeded...: 100.00% 61401 out of 61401
    checks_failed......: 0.00%   0 out of 61401

    ✓ status 200

    CUSTOM
    sponsor_latency................: avg=97.83ms min=2.46ms med=4.93ms p(95)=636.35ms p(99)=781.43ms max=947.68ms

    HTTP
    http_req_duration..............: avg=97.83ms min=2.46ms med=4.93ms p(95)=636.35ms p(99)=781.43ms max=947.68ms
      { expected_response:true }...: avg=97.83ms min=2.46ms med=4.93ms p(95)=636.35ms p(99)=781.43ms max=947.68ms
    http_req_failed................: 0.00%  0 out of 61401
    http_reqs......................: 61401  1018.694397/s

    EXECUTION
    iteration_duration.............: avg=97.92ms min=2.49ms med=5.01ms p(95)=636.44ms p(99)=781.51ms max=947.78ms
    iterations.....................: 61401  1018.694397/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 4.5 MB 75 kB/s
    data_sent......................: 11 MB  175 kB/s



running (1m00.3s), 000/100 VUs, 61401 complete and 0 interrupted iterations
sponsor ✓ [ 100% ] 100 VUs  1m0s